Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/include/proc/p32mz2064daa176.h
extern volatile __GLCDCLUT0bits_t GLCDCLUT0bits __asm__ ("GLCDCLUT0") __attribute__((section("sfrs"), address(0xBF8EA400)));
#define GLCDCLUT1 GLCDCLUT1
extern volatile uint32_t   GLCDCLUT1 __attribute__((section("sfrs"), address(0xBF8EA404)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT1bits_t;
extern volatile __GLCDCLUT1bits_t GLCDCLUT1bits __asm__ ("GLCDCLUT1") __attribute__((section("sfrs"), address(0xBF8EA404)));
#define GLCDCLUT2 GLCDCLUT2
extern volatile uint32_t   GLCDCLUT2 __attribute__((section("sfrs"), address(0xBF8EA408)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT2bits_t;
extern volatile __GLCDCLUT2bits_t GLCDCLUT2bits __asm__ ("GLCDCLUT2") __attribute__((section("sfrs"), address(0xBF8EA408)));
#define GLCDCLUT3 GLCDCLUT3
extern volatile uint32_t   GLCDCLUT3 __attribute__((section("sfrs"), address(0xBF8EA40C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT3bits_t;
extern volatile __GLCDCLUT3bits_t GLCDCLUT3bits __asm__ ("GLCDCLUT3") __attribute__((section("sfrs"), address(0xBF8EA40C)));
#define GLCDCLUT4 GLCDCLUT4
extern volatile uint32_t   GLCDCLUT4 __attribute__((section("sfrs"), address(0xBF8EA410)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT4bits_t;
extern volatile __GLCDCLUT4bits_t GLCDCLUT4bits __asm__ ("GLCDCLUT4") __attribute__((section("sfrs"), address(0xBF8EA410)));
#define GLCDCLUT5 GLCDCLUT5
extern volatile uint32_t   GLCDCLUT5 __attribute__((section("sfrs"), address(0xBF8EA414)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT5bits_t;
extern volatile __GLCDCLUT5bits_t GLCDCLUT5bits __asm__ ("GLCDCLUT5") __attribute__((section("sfrs"), address(0xBF8EA414)));
#define GLCDCLUT6 GLCDCLUT6
extern volatile uint32_t   GLCDCLUT6 __attribute__((section("sfrs"), address(0xBF8EA418)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT6bits_t;
extern volatile __GLCDCLUT6bits_t GLCDCLUT6bits __asm__ ("GLCDCLUT6") __attribute__((section("sfrs"), address(0xBF8EA418)));
#define GLCDCLUT7 GLCDCLUT7
extern volatile uint32_t   GLCDCLUT7 __attribute__((section("sfrs"), address(0xBF8EA41C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT7bits_t;
extern volatile __GLCDCLUT7bits_t GLCDCLUT7bits __asm__ ("GLCDCLUT7") __attribute__((section("sfrs"), address(0xBF8EA41C)));
#define GLCDCLUT8 GLCDCLUT8
extern volatile uint32_t   GLCDCLUT8 __attribute__((section("sfrs"), address(0xBF8EA420)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT8bits_t;
extern volatile __GLCDCLUT8bits_t GLCDCLUT8bits __asm__ ("GLCDCLUT8") __attribute__((section("sfrs"), address(0xBF8EA420)));
#define GLCDCLUT9 GLCDCLUT9
extern volatile uint32_t   GLCDCLUT9 __attribute__((section("sfrs"), address(0xBF8EA424)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT9bits_t;
extern volatile __GLCDCLUT9bits_t GLCDCLUT9bits __asm__ ("GLCDCLUT9") __attribute__((section("sfrs"), address(0xBF8EA424)));
#define GLCDCLUT10 GLCDCLUT10
extern volatile uint32_t   GLCDCLUT10 __attribute__((section("sfrs"), address(0xBF8EA428)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT10bits_t;
extern volatile __GLCDCLUT10bits_t GLCDCLUT10bits __asm__ ("GLCDCLUT10") __attribute__((section("sfrs"), address(0xBF8EA428)));
#define GLCDCLUT11 GLCDCLUT11
extern volatile uint32_t   GLCDCLUT11 __attribute__((section("sfrs"), address(0xBF8EA42C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT11bits_t;
extern volatile __GLCDCLUT11bits_t GLCDCLUT11bits __asm__ ("GLCDCLUT11") __attribute__((section("sfrs"), address(0xBF8EA42C)));
#define GLCDCLUT12 GLCDCLUT12
extern volatile uint32_t   GLCDCLUT12 __attribute__((section("sfrs"), address(0xBF8EA430)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT12bits_t;
extern volatile __GLCDCLUT12bits_t GLCDCLUT12bits __asm__ ("GLCDCLUT12") __attribute__((section("sfrs"), address(0xBF8EA430)));
#define GLCDCLUT13 GLCDCLUT13
extern volatile uint32_t   GLCDCLUT13 __attribute__((section("sfrs"), address(0xBF8EA434)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT13bits_t;
extern volatile __GLCDCLUT13bits_t GLCDCLUT13bits __asm__ ("GLCDCLUT13") __attribute__((section("sfrs"), address(0xBF8EA434)));
#define GLCDCLUT14 GLCDCLUT14
extern volatile uint32_t   GLCDCLUT14 __attribute__((section("sfrs"), address(0xBF8EA438)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT14bits_t;
extern volatile __GLCDCLUT14bits_t GLCDCLUT14bits __asm__ ("GLCDCLUT14") __attribute__((section("sfrs"), address(0xBF8EA438)));
#define GLCDCLUT15 GLCDCLUT15
extern volatile uint32_t   GLCDCLUT15 __attribute__((section("sfrs"), address(0xBF8EA43C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT15bits_t;
extern volatile __GLCDCLUT15bits_t GLCDCLUT15bits __asm__ ("GLCDCLUT15") __attribute__((section("sfrs"), address(0xBF8EA43C)));
#define GLCDCLUT16 GLCDCLUT16
extern volatile uint32_t   GLCDCLUT16 __attribute__((section("sfrs"), address(0xBF8EA440)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT16bits_t;
extern volatile __GLCDCLUT16bits_t GLCDCLUT16bits __asm__ ("GLCDCLUT16") __attribute__((section("sfrs"), address(0xBF8EA440)));
#define GLCDCLUT17 GLCDCLUT17
extern volatile uint32_t   GLCDCLUT17 __attribute__((section("sfrs"), address(0xBF8EA444)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT17bits_t;
extern volatile __GLCDCLUT17bits_t GLCDCLUT17bits __asm__ ("GLCDCLUT17") __attribute__((section("sfrs"), address(0xBF8EA444)));
#define GLCDCLUT18 GLCDCLUT18
extern volatile uint32_t   GLCDCLUT18 __attribute__((section("sfrs"), address(0xBF8EA448)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT18bits_t;
extern volatile __GLCDCLUT18bits_t GLCDCLUT18bits __asm__ ("GLCDCLUT18") __attribute__((section("sfrs"), address(0xBF8EA448)));
#define GLCDCLUT19 GLCDCLUT19
extern volatile uint32_t   GLCDCLUT19 __attribute__((section("sfrs"), address(0xBF8EA44C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT19bits_t;
